blog/localhost-flask-uwsgi-nginx-macos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>flask, uwsgi, nginx, macos Localhost setup - @kholidfu</title>
<!-- 2016-11-02 Wed 07:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kholid Fuadi" />
<link rel="stylesheet" type="text/css" href="../stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">flask, uwsgi, nginx, macos Localhost setup - @kholidfu</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Flask design</a></li>
<li><a href="#sec-2">2. Install</a>
<ul>
<li><a href="#sec-2-1">2.1. nginx</a></li>
<li><a href="#sec-2-2">2.2. uwsgi</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Setup</a>
<ul>
<li><a href="#sec-3-1">3.1. nginx</a></li>
<li><a href="#sec-3-2">3.2. nginx.conf</a></li>
<li><a href="#sec-3-3">3.3. /usr/local/etc/nginx/sites-*</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Start nginx</a></li>
<li><a href="#sec-5">5. Setup uwsgi</a>
<ul>
<li><a href="#sec-5-1">5.1. Buat berkas wsgi.py in Flask app root dir, which contain:</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Jalankan uwsgi</a></li>
<li><a href="#sec-7">7. Coba jalankan aplikasi Flask di browser</a></li>
<li><a href="#sec-8">8. Referensi</a></li>
</ul>
</div>
</div>
<p>
Terbiasa melakukan setup di lingkungan Linux, mencoba setup di
lingkungan macos merupakan satu tantangan tersendiri. Semoga bermanfaat!
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Flask design</h2>
<div class="outline-text-2" id="text-1">
<p>
Berikut ini struktur file aplikasi Flask yang saya buat.
</p>
<div class="org-src-container">

<pre class="src src-text">~/git/blooms$ tree -L 2
.
|-- README.md
|-- app
|   |-- GeoLite2-Country.mmdb
|   |-- __init__.py
|   |-- assets
|   |-- command.py
|   |-- config.py
|   |-- forms.py
|   |-- models.py
|   |-- static
|   |-- templates
|   |-- utils.py
|   `-- views.py
|-- blooms.db
|-- requirements.txt
`-- wsgi.py
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Install</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> nginx</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Install nginx menggunakan brew
</p>
<div class="org-src-container">

<pre class="src src-sh">brew install nginx
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> uwsgi</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Install uwsgi
</p>
<div class="org-src-container">

<pre class="src src-sh">pip install uwsgi
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Setup</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> nginx</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Buat direktori untuk log
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo mkdir /Library/Logs/nginx
</pre>
</div>
<p>
Buat berkas access.log
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo touch /Library/Logs/nginx/access.log
</pre>
</div>
<p>
Tes konfigurasi
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo nginx -t
</pre>
</div>
<p>
View access log
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo tail -f /Library/Logs/nginx/access.log
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> nginx.conf</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Sunting <code>nginx.conf</code> yang terletak di <code>/usr/local/etc/nginx/nginx.conf</code>
</p>
<ul class="org-ul">
<li>Uncomment baris berikut:
<div class="org-src-container">

<pre class="src src-text">log_format main '$remote_addr - ...
</pre>
</div>
</li>
<li>Uncomment access.log
<div class="org-src-container">

<pre class="src src-text">access_log /Library/Logs/nginx/access.log main;
</pre>
</div>
</li>
<li>Tambahkan include
<div class="org-src-container">

<pre class="src src-text">include /usr/local/etc/nginx/sites-enabled/*;
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> /usr/local/etc/nginx/sites-*</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Karena direktori ini by default belum ada, mari kita bikin dulu.
</p>

<div class="org-src-container">

<pre class="src src-sh">mkdir -p /usr/local/etc/nginx/sites-{enabled,available}
touch -p /usr/local/etc/nginx/sites-available/default
cd ../sites-enabled
ln -s ../sites-available/default
emacs /usr/local/etc/nginx/sites-available/default
</pre>
</div>

<p>
Isi berkas default dengan baris berikut:
</p>

<div class="org-src-container">

<pre class="src src-text">server {
    listen 80;
    listen [::]:80;
    server_name localhost;
    location / { try_files $uri @app; }
    location @app {
	include uwsgi_params;
	uwsgi_pass unix:/tmp/uwsgi.sock;
    }   
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Start nginx</h2>
<div class="outline-text-2" id="text-4">
<p>
Jalankan nginx menggunakan brew services:
</p>

<div class="org-src-container">

<pre class="src src-sh">brew services list
brew services start nginx
</pre>
</div>

<p>
Kalau kedua cara di atas gagal, coba
</p>

<div class="org-src-container">

<pre class="src src-sh">brew services stop nginx
pkill nginx
# check config sudah benar belum
sudo nginx -t
# if no error
sudo nginx
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Setup uwsgi</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-sh">. bin/activate
pip install uwsgi
</pre>
</div>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Buat berkas wsgi.py in Flask app root dir, which contain:</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-python">from app import app

if __name__ == "__main__":
    # sesuaikan port dengan konfig nginx
    # (default di macos port 8080, bisa dilihat di nginx.conf)
    app.run(debug=True, port=8080)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Jalankan uwsgi</h2>
<div class="outline-text-2" id="text-6">
<p>
Jalankan uwsgi dengan perintah berikut:
</p>

<div class="org-src-container">

<pre class="src src-sh">uwsgi --socket /tmp/uwsgi.sock --module wsgi --cale app --virtualenv ~/git/blooms/ --chdir ~/git/blooms --chmod-socket=666
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Coba jalankan aplikasi Flask di browser</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-text">http://127.0.0.1
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Referensi</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="https://gist.github.com/jimothyGator/5436538">someone gist</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-11-02 Wed&gt;</span></span></p>
<p class="author">Author: Kholid Fuadi</p>
<p class="date">Created: 2016-11-02 Wed 07:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
